legacyvv/GD32F470IIH6/08_LVGL_Joystick_test/Soft_Drive/lcd.h
/*!
    \file    lcd.h
    \brief   the header file of LCD driver

    \version 2022-04-18, V2.0.0, demo for GD32F4xx
*/

/*
    Copyright (c) 2022, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef LCD_H
#define LCD_H

#include "gd32f4xx.h"

#define HORIZONTAL_SYNCHRONOUS_PULSE 	4
#define HORIZONTAL_BACK_PORCH 			8
#define ACTIVE_WIDTH 					800
#define HORIZONTAL_FRONT_PORCH 			8

#define VERTICAL_SYNCHRONOUS_PULSE 		8
#define VERTICAL_BACK_PORCH 			16
#define ACTIVE_HEIGHT 					480
#define VERTICAL_FRONT_PORCH 			16

//#define CANVAS_H_OFFSET 				64
//#define CANVAS_V_OFFSET 				32
//#define CANVAS_H 						480
//#define CANVAS_V 						272

#define CANVAS_H_OFFSET 				0
#define CANVAS_V_OFFSET 				0
#define CANVAS_H 						800
#define CANVAS_V 						480

#define POINTER_DIA 					15
#define POINTER_RADIUS 					7

#define LCD_BUF_LEN 					(CANVAS_H * CANVAS_V)

#define SET_LCD_BLK(x) 					timer_channel_output_pulse_value_config(TIMER2, TIMER_CH_1, x);

typedef struct{
	uint16_t x;
	uint16_t y;
}pointer_coordinate_struct;

extern pointer_coordinate_struct pointer_coordinate;

extern uint16_t lcd_tli_buffer[CANVAS_H * CANVAS_V];
extern void tli_gpio_config(void);
extern void lcd_backlight_gpio_config(void);
extern void lcd_backlight_pwm_config(void);
extern void clear_pixel(uint16_t color);
extern void display_init(void);
extern void ipa_config(uint32_t baseaddress);
extern void ipa_trig(uint16_t sx, uint16_t sy, uint16_t ex, uint16_t ey, uint32_t src, uint32_t dst);

#endif
